Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: And at the sounding of the first, a rain of ice and fire, mixed with blood, was sent on the earth: and a third part of the earth, and of the trees, and all green grass was burned up.
chr: ᎢᎬᏱᏱ ᎨᏒ ᏗᎧᎿᏩᏗᏙᎯ ᎤᏤᎷᎯᏒᎩ, ᎠᎴ ᎤᎨᎲ ᏔᏅᏒᎩ ᎠᏥᎸ ᎠᎴ ᎤᏁᏍᏓᎳ ᎩᎬ ᎤᏓᏑᏱ ᎨᏒᎩ, ᎠᎴ ᎡᎶᎯ ᏫᏕᎨᎦᏗᏅᏒᎩ, ᎠᎴ ᏕᏡᎬ ᏦᎢ ᎢᎦᏛᎯ ᎨᏒ ᎾᏍᎩ ᏌᏉ ᎢᏳᏪᏨᎯ ᏚᎪᏅᎩ, ᎠᎴ ᏂᎦᏛ ᎢᏤ ᎧᏁᏍᎦ ᎤᎪᏅᎩ.

source: And at the sounding of the second angel, it was as if a great mountain burning with fire was sent into the sea: and a third part of the sea became blood,
chr: ᏔᎵᏁᏃ ᎨᏒ ᏗᎧᎿᏩᏗᏙᎯ ᎤᏤᎷᎯᏒᎩ, ᎣᏓᎸᏃ ᎡᏆ ᏣᏓᏪᎵᎩᏍᎪ ᎾᏍᎩᏯ ᎨᏒᎩ ᎠᎺᏉᎯ ᏭᎾᏗᏅᏒᎩ; ᎠᎺᏉᎯᏃ ᏦᎢ ᎢᎦᏛᎯ ᎨᏒ ᎾᏍᎩ ᏌᏉ ᎢᏳᏪᏨᎯ ᎩᎬ ᏄᎵᏍᏔᏅᎩ;

source: And destruction came on a third part of the living things which were in the sea, and on a third part of the ships.
chr: ᎠᎴ ᏦᎢ ᎢᎨᏥᏛᎯ ᎨᏒ ᎾᏍᎩ ᎨᎦᏁᎳᏅᎯ ᎨᏒ ᎠᎺᏉᎯ ᎠᏁᎲᎢ ᎠᎴ ᏗᏅᏃᏛ ᎨᏒ ᎾᏍᎩ ᏌᏉ ᎢᏳᏂᏨᎯ ᏚᏂᎵᏬᏨᎩ; ᎠᎴ ᏥᏳ ᏧᏛᎾ ᏦᎢ ᎢᏗᎦᏛᎯ ᎨᏒ ᎾᏍᎩ ᏌᏉ ᎢᏳᏪᏨᎯ ᏚᏲᏨᎩ.

source: And at the sounding of the third angel, there went down from heaven a great star, burning like a flame, and it came on a third part of the rivers, and on the fountains of water.
chr: ᏦᎢᏁᏃ ᎨᏒ ᏗᎧᎿᏩᏗᏙᎯ ᎤᏤᎷᎯᏒᎩ, ᎤᏣᏘᏃ ᎡᏆ ᏃᏈᏏ ᎤᏬᎭᏒᎩ ᎦᎸᎳᏗ ᏓᏳᏓᎴᏅᎩ, ᎠᏨᏍᏙᏗ ᏣᏓᏪᎵᎩᏍᎪ ᎾᏍᎩᏯᎢ, ᎡᏉᏂᏃ ᏚᏪᏴ ᏦᎢ ᎢᏗᎦᏛᎯ ᎨᏒ ᎾᏍᎩ ᏌᏉ ᎢᏳᏪᏨᎯ ᏚᏥᏍᏠᏨᎩ, ᎠᎴ ᎠᎹ ᏕᎦᏄᎪᎬ ᏚᏥᏍᏠᏨᎩ.

source: And the name of the star is Wormwood: and a third part of the waters became bitter; and a number of men came to their end because of the waters, for they were made bitter.
chr: ᎾᏍᎩᏃ Ꮎ ᏃᏈᏏ ᎤᏴᏍᏗ ᎦᏙᎥ; ᏦᎢᏃ ᎢᏗᎦᏛᎯ ᎨᏒ ᎡᏉᏂ ᏚᏪᏴ ᎾᏍᎩ ᏌᏉ ᎢᏳᏪᏨᎯ ᎤᏴᏍᏗ ᏂᏚᎵᏍᏔᏅᎩ; ᎠᎴ ᎤᏂᏣᏘ ᏴᏫ ᎠᎹ ᎤᎾᏗᏔᎲ ᏚᏂᏲᎱᏒᎩ, ᏅᏓᎦᎵᏍᏙᏗᏍᎬᎩ ᎠᎹ ᎤᏴᏍᏗ ᏂᏚᎵᏍᏔᏅᎢ.

source: And at the sounding of the fourth angel, a third part of the sun, and of the moon, and of the stars was made dark, so that there was no light for a third part of the day and of the night.
chr: ᏅᎩᏁᏃ ᎨᏒ ᏗᎧᎿᏩᏗᏙᎯ ᎤᏤᎷᎯᏒᎩ, ᏅᏙᏃ ᎢᎦ ᎡᎯ ᏦᎢ ᎢᎦᏛᎯ ᎨᏒ ᎾᏍᎩ ᏌᏉ ᎢᏳᏪᏨᎯ ᎤᏩᏂᎸᎩ, ᎠᎴ ᏦᎢ ᎢᎦᏛᎯ ᎨᏒ ᎾᏍᎩ ᏌᏉ ᎢᏳᏪᏨᎯ ᏅᏙ ᏒᏃᏱ ᎡᎯ ᎤᏩᏂᎸᎩ, ᎠᎴ ᏦᎢ ᎢᏗᎦᏛᎯ ᎨᏒ ᎾᏍᎩ ᏌᏉ ᎢᏳᏪᏨᎯ ᏃᏈᏏ ᎠᏂᎧᎸ ᏚᏩᏂᎸᎩ; ᎾᏍᎩᏃ ᏦᎢ ᎢᏗᎦᏛᎯ ᎨᏒ ᎾᏍᎩ ᏌᏉ ᎢᏳᏪᏨᎯ ᏚᎵᏏᎲᏒᎩ, ᎠᎴ ᎢᎦ ᏦᎢ ᎢᎦᏛᎯ ᎨᏒ ᎾᏍᎩ ᏌᏉ ᎢᏳᏪᏨᎯ ᎥᏝ ᏯᎦᎵᏍᎨᎢ, ᎠᎴ ᏒᏃᏱ ᏦᎢ ᎢᎦᏛᎯ ᎨᏒ ᎾᏍᎩ ᏌᏉ ᎢᏳᏪᏨᎯ ᎾᏍᏉ ᎥᏝ ᏯᎦᎵᏍᎨᎢ.

source: And there came to my ears the cry of an eagle in flight in the middle of heaven, saying with a great voice, Trouble, trouble, trouble, to all on the earth, because of the other voices of the horns of the three angels, whose sounding is still to come.
chr: ᎠᎴ ᏓᏆᎧᎾᏅᎩ, ᎠᎴ ᎠᏆᏛᎦᏅᎩ ᏗᎧᎿᏩᏗᏙᎯ ᎦᎸᎶᎢ ᎠᏰᎵ ᎦᏃᎯᎵᏒᎩ ᎠᏍᏓᏯ ᎤᏪᎷᎬᎩ ᎯᎠ ᏂᎦᏪᏍᎬᎩ, ᎤᏲᎢᏳ, ᎤᏲᎢᏳ ᎤᏲᎢᏳ ᎢᏳᎾᎵᏍᏓᏁᏗ ᎡᎶᎯ ᏓᏁᏩᏗᏒᎢ, ᏅᏗᎦᎵᏍᏙᏗᎭ ᏗᏐᎢ ᎠᏤᎷᎩ ᏗᏤᎷᎯᏍᏗ ᎨᏒ ᎾᏍᎩ ᏗᏂᎧᎿᏩᏗᏙᎯ ᏦᎢ ᎢᏯᏂᏛ ᏓᏂᏁᎲᎢ, ᎠᏏ ᏧᏂᏤᎷᎯᏍᏗ ᏥᎩ.

source: And at the sounding of the fifth angel I saw a star falling from heaven to the earth: and there was given to him the key of the great deep.
chr: ᎯᏍᎩᏁᏃ ᎨᏒ ᏗᎧᎿᏩᏗᏙᎯ ᎤᏤᎷᎯᏒᎩ, ᎠᎩᎪᎲᎩᏃ ᏃᏈᏏ ᎦᎸᎶᎢ ᏓᏳᏓᎴᏅᎩ ᎡᎶᎯᏃ ᎤᏬᏥᎸᎩ; ᎠᎴ ᎾᏍᎩ [ᏃᏈᏏ] ᎠᏥᏕᎸᎩ ᎠᏍᏚᎢᏍᏗ ᎾᏍᎩ ᏫᎾᏍᏛᎾ ᎠᏔᎴᏒ ᎠᏍᏚᎢᏍᏙᏗ.

source: And he made the great deep open and a smoke went up from it, like the smoke of a great oven; and the sun and the air were made dark because of the smoke.
chr: ᎠᎴ ᏫᎾᏍᏛᎾ ᎠᏔᎴᏒ ᎤᏍᏚᎢᏒᎩ, ᏧᎦᏒᏍᏗᏃ ᎾᎿ ᎠᏔᎴᏒ ᏓᏳᎵᏌᎳᏓᏅᎩ, ᎾᏍᎩᏯ ᎡᏆ ᏔᎷᎩᏍᎩ ᎬᎾᏬᏙᏗᏱ ᏥᏚᎦᏒᏍᏙᎢ; ᏅᏙᏃ ᎢᎦ ᎡᎯ ᎠᎴ ᎦᏃᎴᏍᎬ ᎤᏜᏅᏛ ᏚᎵᏏᎲᏒᎩ ᏅᏓᎦᎵᏍᏙᏗᏍᎬᎩ ᏧᎦᏒᏍᏗ ᎠᏔᎴᏒ ᏙᏗᎴᎲᏍᎬᎢ.

source: And from the smoke locusts came out on the earth; and power was given them, like the power of scorpions.
chr: ᏚᎦᏒᏍᏛᏃ ᏓᏳᏂᏄᎪᏨᎩ ᎥᎴ ᎠᎴ ᎡᎶᎯ ᏚᏂᏰᎵᏒᎩ; ᎠᎴ ᎤᎵᏂᎩᏛ ᎨᏒ ᎨᏥᏁᎸᎩ ᎾᏍᎩᏯ ᏗᏂᏙᎬ ᎠᎾᏓᏨᏯᏍᏗᏍᎩ ᎡᎶᎯ ᎠᏁᎯ ᎤᎵᏂᎩᏛ ᏧᏂᎭ.

source: And they were ordered to do no damage to the grass of the earth, or any green thing, or any tree, but only to such men as have not the mark of God on their brows.
chr: ᎠᎴ ᎨᏥᏁᏤᎸᎩ ᎪᎱᏍᏗ ᎤᏅᏁᏗᏱ ᏂᎨᏒᎾ ᎧᏁᏍᎦ ᎡᎶᎯ ᎤᏰᎬᎢ, ᎠᎴ ᏂᎦᎥᏉᎪᎱᏍᏗ ᎢᏤ ᎤᏰᎾᎥᎢ, ᎠᎴ ᏂᎦᎥᏉ ᏕᏡᎬᎢ; ᎾᏍᎩᏉᏍᎩᏂ Ꮎ ᎤᏅᏒ ᏴᏫ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎤᏓᏰᎸᏙᏗ ᎨᏒ ᏄᏂᏰᎸᏒᎾ ᏗᏂᎬᏓᎨᏂ.

source: And orders were given them not to put them to death, but to give them great pain for five months: and their pain was as the pain from the wound of a scorpion.
chr: ᎠᎴ ᎾᏍᎩ ᎨᏥᏁᎸᎩ ᎾᏍᎩ ᏧᏂᎯᏍᏗᏱ ᏂᎨᏒᎾ ᎨᏒᎢ, ᏧᏂᎩᎸᏗᏉᏍᎩᏂ ᎯᏍᎩ ᎢᏯᏅᏙ; ᎤᎾᏓᎩᎸᏗᏃ ᎨᏒ ᎦᏙᎬ ᎠᏓᏨᏯᏍᏗᏍᎩ ᎤᎾᏓᎩᎸᏗ ᎨᏒ ᎾᏍᎩᏯ ᎨᏒᎩ ᏴᎾ ᎿᏉ ᎤᏪᏨᏯ.

source: And in those days men will be hoping for death, and it will not come to them; and they will have a great desire for death, and death will go in flight from them.
chr: ᎾᎯᏳᏃ ᎨᏒ ᎠᏲᎱᎯᏍᏗ ᎨᏒ ᎤᏂᏲᎮᏍᏗ ᏴᏫ, ᎠᎴ ᎥᏝ ᎤᏂᏩᏛᏗ ᏱᎨᏎᏍᏗ; ᎠᎴ ᎤᎾᏚᎵᏍᎨᏍᏗ ᏧᏂᏲᎱᎯᏍᏗᏱ, ᎠᏎᏃ ᎠᏲᎱᎯᏍᏗ ᎨᏒ ᎤᎾᎵᏘᎡᏗ ᎨᏎᏍᏗ.

source: And the forms of the locusts were like horses made ready for war; and on their heads they had crowns like gold, and their faces were as the faces of men.
chr: ᎥᎴᏃ ᎤᎾᏙᏢᏒ ᎾᏍᎩᏯ ᎨᏒᎩ, ᏐᏈᎵ ᏓᏅᏩ ᎤᏁᏅᏍᏗᏱ ᏥᎨᎦᏛᏅᎢᏍᏙᎢ; ᏚᏄᎵᏍᏚᎸᎩᏃ ᏗᎵᏍᏚᎶ ᎠᏕᎸᏓᎶᏁᎨ ᏗᎪᏢᏔᏅᎯ ᎾᏍᎩᏯᎢ, ᏚᎾᎧᏛᏃ ᏴᏫ ᏚᎾᎧᏛ ᎾᏍᎩᏯ ᎨᏒᎩ.

source: And they had hair like the hair of women, and their teeth were as the teeth of lions.
chr: ᎠᎴ ᏚᏂᏍᏗᏰᎬᎩ ᎠᏂᎨᏴ ᏥᏚᏂᏍᏗᏰᎦ ᎾᏍᎩᏯᎢ, ᎠᎴ ᏓᏂᏄᏙᎬ ᏢᏓᏥ ᎤᏂᏃᏕᎾ ᏥᏓᏂᏄᏙᎦ ᎾᏍᎩᏯ ᎨᏒᎩ.

source: And they had breastplates like iron, and the sound of their wings was as the sound of carriages, like an army of horses rushing to the fight.
chr: ᎠᎴ ᏚᎾᏓᏁᏣᏍᏚᎸᎩ ᏔᎷᎩᏍᎩ ᏗᎪᏢᏔᏅᎯ ᏗᏓᏁᏣᏍᏚᎶ ᎾᏍᎩᏯᎢ; ᏗᏂᏃᎨᏂᏃ ᏚᏃᏴᎬ ᎤᏂᏣᏘ ᏐᏈᎵ ᏓᏆᎴᎷ ᏥᏓᏂᎾᏏᏂᏐ ᏓᎿᏩ ᏣᎾᎢᏐ ᎾᏍᎩᏯ ᎨᏒᎩ.

source: And they have pointed tails like scorpions; and in their tails is their power to give men wounds for five months.
chr: ᏗᏂᏙᎬᏃ ᏗᎾᏓᏨᏯᏍᎩ ᏥᎩ ᎾᏍᎩᏯ ᏓᏂᏂᏓᏛᎩ, ᎠᎴ ᏧᎾᏓᏨᏯᏍᏙᏗ ᏗᏂᏙᎬ ᏚᏙᏢᏒᎩ; ᎠᎴ ᎤᏂᎲᎩ ᎪᎱᏍᏗ ᏧᏅᏁᏗᏱ ᏴᏫ ᎯᏍᎩ ᎢᏯᏅᏙ.

source: They have over them as king the angel of the great deep: his name in Hebrew is Abaddon, and in the Greek language Apollyon.
chr: ᎠᎴ ᎤᎬᏫᏳᎯ ᎤᏂᎧᎲᎩ ᎾᏍᎩ ᏗᎧᎿᏩᏗᏙᎯ ᏥᎩ ᎾᏍᎩ ᏫᎾᏍᏛᎾ ᎠᏔᎴᏒᎢ, ᎾᏍᎩᏃ ᎠᏂᏈᎷ ᎤᏂᏬᏂᎯᏍᏗ ᎠᏆᏙᎾ ᏚᏙᎥ, ᎠᏂᎪᎢᏍᎩᏂ ᎤᏂᏬᏂᎯᏍᏗ ᎨᏒ ᎠᏉᎵᏯᏂ ᏚᏙᎥ.

source: The first Trouble is past: see, there are still two Troubles to come.
chr: ᏌᏉ ᎤᏲ ᎨᏒ ᎤᎶᏐᏅ; ᎬᏂᏳᏉᏃ ᎠᏏ ᏔᎵ ᎤᏲ ᎨᏒ ᏙᏛᏍᏆᎸᎯ.

source: And at the sounding of the sixth angel a voice came to my ears from the horns of the gold altar which is before God,
chr: ᏑᏓᎵᏁᏃ ᎨᏒ ᏗᎧᎿᏩᏗᏙᎯ ᎤᏤᎷᎯᏒᎩ, ᎩᎶᏃ ᎧᏁᎬ ᎠᏆᏛᎦᏅᎩ ᏛᏓᎴᎲᏍᎬᎩ ᏅᎩ ᏂᏕᎤᎷᎬ ᎠᏕᎸᏓᎶᏂᎨ ᎪᏢᏔᏅᎯ ᎠᏥᎸ-ᎨᎳᏍᏗᏱ ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᏄᏛᏅ ᎢᎬᏱᏗᏢ ᏥᎦᎧᎭ,

source: Saying to the sixth angel who had the horn, Make free the four angels who are chained at the great river Euphrates.
chr: ᎯᎠ ᎾᏥᏪᏎᎲᎩ ᏑᏓᎵᏁ ᎨᏒ ᏗᎧᎿᏩᏗᏙᎯ ᎠᏤᎷᎩ ᎦᏁᎯ, ᏔᎸᏒ ᎾᏍᎩ Ꮎ ᏅᎩ ᎢᏯᏂᏛ ᏗᏂᎧᎿᏩᏗᏙᎯ ᎤᏔᏅ ᎡᏉᏂ ᎤᏪᏴ ᎷᏇᏗ ᏥᏕᎨᎦᎸᎥ.

source: And the four angels were made free, who were ready for the hour and day and month and year, that they might put to death a third part of men.
chr: ᎠᎴ ᎾᏍᎩ Ꮎ ᏅᎩ ᎢᏯᏂᏛ ᏗᎾᎧᎿᏩᏗᏙᎯ ᏕᎨᎦᎸᏒᎲᎩ, ᎾᏍᎩ ᎨᎦᏛᏅᎢᏍᏔᏅᎩ ᏌᏉ ᏅᏙ ᎢᏳᏟᎶᏛ ᎢᎪᎯᏛ ᎨᏒᎢ, ᎠᎴ ᏏᎦ ᎨᏒ, ᎠᎴ ᏏᏅᏙ ᎨᏒ, ᎠᎴ ᏑᏕᏘᏴᏛ ᎨᏒᎢ, ᎾᏍᎩ ᏧᏂᎯᏍᏗᏱ ᏦᎢ ᎢᎨᏥᏛᎯ ᏴᏫ ᎾᏍᎩ ᏌᏉ ᎢᏳᏂᏨᎯ ᎨᏒᎢ.

source: And the number of the armies of the horsemen was twice ten thousand times ten thousand: the number of them came to my ears.
chr: ᎠᎴ ᎠᏂᏯᏫᏍᎩ ᏐᏈᎵ ᏧᎾᎩᎸᏗ ᏔᎵᏧᏈ ᎢᏳᏆᏗᏅᏛ ᎾᏂᎥᎩ; ᎠᎴ ᎠᏆᏛᎦᏅᎩ ᎾᏂᎥᎢ.

source: And so I saw the horses in the vision, and those who were seated on them, having breastplates of fire and glass and of burning stone: and the heads of the horses were as the heads of lions; and out of their mouths came fire and smoke and a smell of burning.
chr: ᎾᏍᎩᏃ ᎯᎠ ᏄᎾᏍᏛᎩ ᎥᎦᏥᎪᎥᎩ ᏐᏈᎵ ᎠᏆᏁᎳᏫᏎᎲᎢ, ᎠᎴ ᎾᏍᎩ ᎾᎿ ᏧᎾᎩᎵ, ᏮᎾᏓᏁᏣᏍᏚᎸᎩ ᎠᏥᎸ ᎠᎴ ᏅᏯ ᏤᏏᏂ ᏧᏙᎢᏛ, ᎠᎴ ᏌᎪᏂᎨ ᎠᏓᏪᎳᎩᏍᎩ ᏗᎪᏢᏔᏅᎯ. ᏗᏂᏍᎪᎵᏃ ᏐᏈᎵ ᎠᏓᏥ ᎤᏂᏃᏕᏅ ᏥᏓᏂᏍᎫᏓᏛ ᎾᏍᎩᏯ ᎨᏒᎩ; ᏗᏂᎰᎵᏃ ᏓᎦᏄᎪᎬᎩ ᎠᏥᎸ ᎠᎴ ᏧᎦᏒᏍᏗ ᎠᎴ ᏌᎪᏂᎨ ᎠᏓᏪᎳᎩᏍᎩ.

source: By these evils a third part of men was put to death, by the fire, and the smoke, and the burning smell which came out of their mouths.
chr: ᎯᎠ ᎾᏍᎩ ᏦᎢ ᎢᏳᏓᎴᎩ ᎨᏒ ᏓᏅᏗᏍᎬ, ᏴᏫ ᏦᎢ ᎢᎨᏥᏛᎯ ᎨᏒ ᎾᏍᎩ ᏌᏉ ᎢᏳᏂᏨᎯ ᏕᎨᏥᎸᎩ, ᎾᏍᎩ ᎠᏥᎸ ᎬᏗ, ᎠᎴ ᏧᎦᏒᏍᏗ ᎬᏗ, ᎠᎴ ᏌᎪᏂᎨ ᎠᏓᏪᎳᎩᏍᎩ ᎬᏗ, ᎾᏍᎩ ᏗᏂᎰᎵ ᏥᏙᏓᎦᏄᎪᎬᎢ.

source: For the power of the horses is in their mouths and in their tails: because their tails are like snakes, and have heads, and with them they give wounds.
chr: ᎪᎱᏍᏗᏰᏃ ᎤᎾᏓᏛᏁᏗᏱ ᏗᏂᎰᎵ ᎠᎴ ᏓᏂᏂᏓᏛ ᏛᏓᎴᎲᏍᎬᎩ; ᏓᏂᏂᏓᏛᏰᏃ ᎢᎾᏛ ᏥᏄᏍᏗ ᎾᏍᎩᏯ ᎨᏒᎩ, ᎠᎴ ᏓᏂᏍᎫᏓᏛᎩ, ᎠᎴ ᎾᏍᎩ ᏓᏅᏗᏍᎬᎩ ᎪᎱᏍᏗ ᎠᎾᏓᏛᏁᎲᎩ.

source: And the rest of the people, who were not put to death by these evils, were not turned from the works of their hands, but went on giving worship to evil spirits, and images of gold and silver and brass and stone and wood which have no power of seeing or hearing or walking:
chr: ᎠᎴ ᎠᏂᏐᎢ ᏴᏫ ᎯᎠ ᎾᏍᎩ ᎤᏕᏯᏙᏗ ᎨᏒ ᏧᏂᎸᎯ ᏂᎨᏒᎾ, ᎠᏏᏉ ᎥᏝ ᏱᏓᏂᏁᏟᏴᏍᎨ ᏚᎾᏓᏅᏛ ᎤᏲ ᏯᏂᏰᎸᏍᎨ ᏧᏃᏰᏂ ᎬᏗ ᏚᏂᎸᏫᏍᏓᏁᎸᎢ, ᎾᏍᎩ ᎠᏂᏍᎩᎾ ᏧᎾᏓᏙᎵᏍᏓᏁᏗᏱ ᏂᎨᏒᎾ ᎢᏳᎵᏍᏙᏗᏱ, ᎠᎴ ᎤᏁᎳᏅᎯ ᏗᏰᎸᎯ ᎠᏕᎸ ᏓᎶᏂᎨ ᏗᎪᏢᏔᏅᎯ, ᎠᎴ ᎠᏕᎸ ᎤᏁᎬ, ᎠᎴ ᎥᏣᏱ, ᎠᎴ ᏅᏯ, ᎠᎴ ᎠᏓ ᏗᎪᏢᏔᏅᎯ; ᎾᏍᎩ ᎬᏩᏂᎪᏩᏗ ᏂᎨᏒᎾ ᏥᎩ, ᎠᎴ ᎬᏩᎾᏛᎪᏗ ᏂᎨᏒᎾ ᏥᎩ, ᎠᎴ ᎬᏩᏁᏓᏍᏗ ᏂᎨᏒᎾ ᏥᎩ.

source: And they had no regret for putting men to death, or for their use of secret arts, or for the evil desires of the flesh, or for taking the property of others.
chr: ᎥᏝ ᎠᎴ ᎤᏲ ᏳᏂᏰᎸᏅ ᏚᎾᏓᎸᎢ, ᎠᎴ ᏚᎾᏙᏅᎸᎢ, ᎠᎴ ᎤᏕᎵᏛ ᏚᎾᏂᏏᏂᏙᎸᎢ, ᎠᎴ ᎤᏂᏃᏍᎩᏒᎢ.

source: And I saw another strong angel coming down out of heaven, clothed with a cloud; and an arch of coloured light was round his head, and his face was like the sun, and his feet like pillars of fire;
chr: ᎠᎴ ᏅᏩᏓᎴ ᎤᎵᏂᎩᏛ ᏗᎧᎿᏩᏗᏙᎯ ᎥᏥᎪᎥᎩ ᎦᎸᎳᏗ ᏓᏳᏠᎠᏒᎩ, ᎤᎶᎩᎸ ᎤᏄᏬᏍᏛᎩ; ᎠᎴ ᎠᏍᎪᎵ ᎤᏅᎪᎳᏛᎩ, ᎠᎴ ᎤᎧᏛ ᏅᏙ ᎢᎦ ᎡᎯ ᎾᏍᎩᏯ ᎨᏒᎩ, ᏧᎳᏏᏕᏂᏃ ᏗᎦᎫᏍᏛᏗ ᎠᏥᎸ ᏗᎪᏢᏔᏅᎯ ᎾᏍᎩᏯ ᎨᏒᎩ.

source: And he had in his hand a little open book: and he put his right foot on the sea, and his left on the earth;
chr: ᎪᏪᎵᏃ ᎤᏍᏗ ᎤᏒᎦᎸᎩ ᎠᏍᏚᎢᏛ; ᎠᎦᏘᏏᏃ ᎤᎳᏏᏕᏂ ᎠᎺᏉᎯ ᎤᎳᏏᏅᎩ, ᎠᎦᏍᎦᏂᏃ [ᎤᎳᏏᏕᏂ] ᎦᏙᎯ ᎤᎳᏏᏅᎩ,

source: And he gave a loud cry, like the angry voice of a lion: and at his cry the voices of the seven thunders were sounding.
chr: ᎠᎴ ᎠᏍᏓᏯ ᎤᏪᎷᏅᎩ, ᏢᏓᏥ ᎤᏃᏕᏅ ᏣᏴᎪ ᎾᏍᎩᏯᎢ; ᎾᏍᎩᏃ ᎤᏪᎷᏅ, ᎦᎵᏉᎩ ᎠᏂᏴᏓᏆᎶᏍᎩ ᎤᏂᏴᏓᏆᎶᎥᎩ.

source: And when the seven thunders had given out their voices, I was about to put their words down: and a voice from heaven came to my ears, saying, Keep secret the things which the seven thunders said, and do not put them in writing.
chr: ᎠᎴ ᎦᎵᏉᎩ ᎠᏂᏴᏓᏆᎶᏍᎩ ᎤᏂᏴᏓᏆᎶᎥ, ᏓᎪᏪᎳᏂᏒᎩ; ᎠᏆᏛᎦᏅᎩᏃ ᎧᏁᎬ ᎦᎸᎳᏗ ᏓᏳᎶᏒᎩ ᎯᎠ ᏅᏛᎩᏪᏎᎲᎩ, ᏘᏍᏚᎲᎦᏉ ᎾᏍᎩ ᎦᎵᏉᎩ ᎠᏂᏴᏓᏆᏍᎩ ᏄᏂᏪᏒᎢ, ᎠᎴ ᏞᏍᏗ ᏦᏪᎳᏅᎩ.

source: And the angel which I saw taking his position on the sea and on the earth, put up his right hand to heaven,
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᏥᎪᎥᎯ ᎠᎺᏉᎯ ᎠᎴ ᎦᏙᎯ ᏧᏔᏏᏅᎯ, ᎦᎸᎳᏗ ᎢᏗᏢ ᎤᏌᎳᏓᏅᎩ ᎤᏬᏰᏂ,

source: And took his oath by him who is living for ever and ever, who made the heaven and the things in it, and the earth and the things in it, and the sea and the things in it, that there would be no more waiting:
chr: ᎠᎴ ᎤᏁᎢᏍᏔᏅᎩ, ᎾᏍᎩ Ꮎ ᏂᎪᎯᎸ ᎠᎴ ᏂᎪᎯᎸ ᏤᎭ, ᎾᏍᎩ ᎦᎸᎶᎢ ᎤᏬᏢᏅᎯ ᏥᎩ, ᎠᎴ ᎾᏍᎩ ᎾᎿ ᏤᎿᎠ, ᎠᎴ ᎡᎶᎯ, ᎠᎴ ᎾᏍᎩ ᎾᎿ ᏤᎿᎠ, ᎠᎴ ᎠᎺᏉᎯ, ᎠᎴ ᎾᏍᎩ ᎾᎿ ᏤᎿᎠ, ᎥᏝ ᎿᏉ ᎤᏟ ᎢᎪᎯᏛ ᏱᎪᎯᏗᏏᏎᏍᏗ ᎤᏛᏅᎩ.

source: But in the days of the voice of the seventh angel, when the sound of his horn is about to come, then will the secret of God be complete, of which he gave the good news to his servants the prophets.
chr: ᎦᎵᏉᎩᏁᏍᎩᏂ ᏗᎧᎿᏩᏗᏙᎯ ᎧᏁᏨᎭ ᎢᏳᎢ, ᎿᏉ ᎠᎴᏅᎲᎭ ᎠᏤᎷᎯᏒᎭ, ᎤᏕᎵᏛ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ ᎤᎵᏰᎢᎶᎯᏍᏗ ᎨᏎᏍᏗ, ᎾᏍᎩᏯ ᎬᏂᎨᏒ ᏂᏚᏩᏁᎸ ᏧᏅᏏᏓᏍᏗ ᎠᎾᏙᎴᎰᏍᎩ.

source: And the voice came to me again from heaven, saying, Go, take the book which is open in the hand of the angel who has his place on the sea and on the earth.
chr: ᎧᏁᎬᏃ ᎠᏆᏛᎦᏅᎯ ᎦᎸᎳᏗ ᏅᏓᏳᏓᎴᏅᎯ ᏔᎵᏁ ᎠᎩᏁᏤᎸᎩ, ᎠᎴ ᎯᎠ ᏄᏪᏒᎩ, ᎮᎾ, ᎠᎴ ᏫᎾᎩ ᎤᏍᏗ ᎪᏪᎵ ᎠᏍᏚᎢᏛ ᏧᏒᎦᎸ ᏗᎧᎿᏩᏗᏙᎯ ᏥᎦᏙᎦ ᏥᏚᎳᏍᎦ ᎠᎺᏉᎯ ᎠᎴ ᎦᏙᎯ.

source: And I went to the angel, and said to him, Give me the little book. And he said to me: Put it in your mouth; and it will make your stomach bitter, but in your mouth it will be sweet as honey.
chr: ᎠᏇᏅᏒᎩᏃ ᏗᎧᎿᏩᏗᏙᎯ ᏗᎦᏙᎬᎢ, ᎠᎴ ᎯᎠ ᏅᏥᏪᏎᎸᎩ, ᏍᎩᏅᎥᏏ Ꮎ ᎤᏍᏗ ᎪᏪᎵ. ᎯᎠᏃ ᎾᎩᏪᏎᎸᎩ, ᎯᎾᎩ ᎠᎴ ᎯᏯᎣᎾ; ᏣᏍᏉᎵᏱᏃ ᏩᏚᎵᏏ ᏥᏄᎦᎾᎯ ᎢᏳᎦᎾᏍᏛ ᏅᏓᏨᏁᎵ.

source: And I took the little book out of the angel's hand and did as he said; and it was sweet as honey in my mouth: and when I had taken it, my stomach was made bitter.
chr: ᎪᏪᎵᏃ ᎤᏍᏗ ᏗᎧᎿᏩᏗᏙᎯ ᎤᏒᎦᎸ ᏩᎩᏁᏒᎩ, ᎠᎴ ᎠᎩᏯᎣᏅᎩ; ᏥᎰᎵᏃ ᎠᏆᏅᏍᎦᎸ ᏩᏚᎵᏏ ᏥᏄᎦᎾᎯ ᏄᎦᎾᏒᎩ; ᎠᎩᏯᎥᏃ ᎠᎩᏍᏉᎵᏱ ᎡᎯᏍᏗᏳ ᏄᏩᏁᎸᎩ.

source: And they said to me, You are to give word again of what is coming in the future to the peoples and nations and languages and kings.
chr: ᎯᎠᏃ ᎾᎩᏪᏎᎸᎩ, ᏔᎵᏁ ᏛᎭᏙᎴᎰᏏ ᎤᏂᏣᏘ ᎠᏂᎦᏔᎲᎢ, ᎠᎴ ᏑᎾᏓᎴᎩ ᎠᏁᎲ ᏴᏫ, ᎠᎴ ᏧᏓᎴᏅᏛ ᏗᏂᏬᏂᏍᎩ ᎨᏒ ᏴᏫ, ᎠᎴ ᏧᎾᏓᎴᏅᏛ ᎤᏂᎬᏫᏳᎯ.

source: And there was given to me a measuring rod: and one said, Go up and take the measure of the house of God, and the altar, and the worshippers in it.
chr: ᎠᎴ ᎦᎾᏍᏓ ᎥᎩᏕᎸᎩ ᎠᏙᎳᏅᏍᏗ ᎾᏍᎩᏯᎢ; ᏗᎧᎿᏩᏗᏙᎯᏃ ᎤᎴᏅᎩ, ᎯᎠ ᏄᏪᏒᎩ, ᏔᎴᎲᎦ, ᎠᎴ ᎭᏟᎶᏣ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎠᎴ ᎠᏥᎸ-ᎨᎳᏍᏗᏱ, ᎠᎴ ᎾᏍᎩ Ꮎ ᎠᎾᏓᏙᎵᏍᏗᏍᎩ ᏥᎩ ᎾᎿᏂ.

source: But do not take the measure of the space outside the house; because it has been given to the nations: and the holy town will be under their feet for forty-two months.
chr: ᎤᏜᏅᏛᏍᎩᏂ ᏗᎦᎳᏫᎢᏍᏗᏱ ᏙᏱᏗᏢ ᏥᎪᏢᎭ, ᎯᏃᎯᏴᎭ, ᎠᎴ ᏞᏍᏗ ᏣᏟᎶᎥᎩ, ᏧᎾᏓᎴᏅᏛᏰᏃ ᏴᏫ ᎨᏥᏁᎸᎯ ᎾᏍᎩ; ᎠᎴ ᎦᎸᏉᏗᏳ ᎦᏚᎲ ᎤᎾᎳᏍᏓᎡᏗ ᎨᏎᏍᏗ ᏅᎦᏍᎪᎯ ᏔᎵᎦᎵ ᎢᏯᏅᏙ.

source: And I will give orders to my two witnesses, and they will be prophets for a thousand, two hundred and sixty days, clothed with haircloth.
chr: ᏗᏆᏤᎵᏃ ᎠᏂᏔᎵ ᎠᏂᎦᏔᎯ ᏓᎦᏥᏁᎵ [ᎤᎾᏙᎴᎰᎯᏍᏗᏱ] ᎠᎴ ᎠᎾᏙᎴᎰᏍᎨᏍᏗ ᏌᏉ ᎢᏯᎦᏴᎵ ᏔᎵᏧᏈ ᏑᏓᎵᏍᎪᎯᏃ ᏧᏒᎯᏛ, ᏧᏏᏕᏅ ᏚᎾᏄᏩᎡᏍᏗ.

source: These are the two olive-trees and the two lights, which are before the Lord of the earth.
chr: ᎯᎠ ᎾᏍᎩ ᎣᎵᏩ ᏔᎵ ᏕᏡᎬᎢ, ᎠᎴ ᏔᎵ ᏗᏨᏍᏙᏗ ᏗᎦᎪᏙᏗᏱ ᏥᏕᎦᎧᎭ ᎤᏁᎳᏅᎯ ᎡᎶᎯ ᎤᏬᏢᏅᎯ ᏄᏛᏅ ᎢᎬᏱᏗᏢ.

source: And if any man would do them damage, fire comes out of their mouth and puts an end to those who are working against them: and if any man has a desire to do them damage, in this way will he be put to death.
chr: ᎢᏳᏃ ᎩᎶ ᎪᎱᏍᏗ ᏙᎬᏁᎮᏍᏗ ᎾᏍᎩ, ᎠᏥᎸ ᏗᏂᎰᎵ ᏗᎦᏄᎪᎨᏍᏗ, ᎠᎴ ᎤᏂᏛᏗᏍᎨᏍᏗ ᎬᏩᏂᏍᎦᎩ; ᎢᏳ ᎠᎴ ᎩᎶ ᎪᎱᏍᏗ ᏧᏩᏁᏗᏱ ᎤᏚᎵᏍᎨᏍᏗ, ᎾᏍᎩ ᎢᏯᎬᏁᏗ ᎠᏥᎢᏍᏗ ᎨᏎᏍᏗ.

source: These have the power to keep the heaven shut, so that there may be no rain in the days when they are prophets: and they have power over the waters to make them into blood, and to send every sort of disease on the earth as their pleasure is.
chr: ᎯᎠ ᎾᏍᎩ ᎤᏂᎭ ᎦᎸᎳᏗ ᎤᏂᏍᏚᏗᏱ, ᎾᏍᎩ ᎤᎦᏅᏗᏱ ᏂᎨᏒᎾ ᎠᎾᏙᎡᎰᏍᎬ ᎢᎪᎯᏛ; ᎠᎴ ᎤᏂᎭ ᎠᎹᏱ ᏚᏪᏯᏗᏒ ᎩᎬ ᎢᏧᏅᏁᏗᏱ, ᎠᎴ ᎾᏍᎩ ᎢᏳᏅᏂᏐᏗᏱ ᏂᎦᎥᏉ ᎤᏕᏯᏙᏗ ᎨᏒ ᎡᎶᎯ ᎤᎷᏤᏗᏱ ᎢᎦᎢᏉ ᎠᏁᎵᏍᎬᎢ.

source: And when they have come to the end of their witness, the beast which comes up out of the great deep will make war on them and overcome them and put them to death.
chr: ᎿᏉᏃ ᎤᏂᏍᏆᏛ ᎾᏍᎩ ᎤᏂᏃᎮᏗ ᎨᏒᎢ, ᏅᎩ-ᏗᎦᏅᏌᏗ ᎾᏍᎩ ᏫᎾᏍᏛᎾ ᎠᏔᎴᏒ ᏨᏗᎦᎾᏄᎪᎦ ᏓᎿᏩ ᏅᏓᎬᏁᎵ ᏓᏳᎾᏡᏔᏂ, ᎠᎴ ᏓᏳᏂᏎᎪᎩᏏ, ᎠᎴ ᏙᏓᏳᏂᎵ.

source: And their dead bodies will be in the open street of the great town, which in the spirit is named Sodom and Egypt, where their Lord was put to death on the cross.
chr: ᎾᏍᎩᏃ ᏧᏂᏲᎱᏒᎯ ᏗᏂᏰᎸᎢ ᏕᎦᏁᏍᏗ ᏕᎦᎳᏅᏛ ᎡᏓᏍᏗᏱ ᎡᏆ ᎦᏚᎲᎢ, ᎾᏍᎩ ᏓᏟᎶᏍᏛ ᏐᏓᎻ ᏣᏃᏎᎭ ᎠᎴ ᎢᏥᏈ, ᎾᎿ ᎾᏍᏉ ᎤᎬᏫᏳᎯ ᎢᎦᏤᎵ ᎠᏥᎸᎢ.

source: And the peoples and tribes and languages and nations will be looking on their dead bodies three days and a half, and will not let their dead bodies be put in the earth.
chr: ᎢᎦᏛᏃ ᎾᏍᎩ Ꮎ ᏴᏫ, ᎠᎴ ᎪᎱᏍᏗ ᏗᎾᏓᏛᎿ ᎨᏒᎢ, ᎠᎴ ᏧᏓᎴᏅᏛ ᏗᏂᏬᏂᏍᎩ ᎨᏒᎢ, ᎠᎴ ᎤᎾᏓᏤᎵᏛ ᏴᏫ ᏓᏁᏩᏗᏒᎢ, ᏓᏂᎪᏩᏗᏍᎨᏍᏗ ᏧᏂᏲᎱᏒᎯ ᏗᏂᏰᎸᎢ ᏦᎢ ᎢᎦ ᏅᎩᏁᏃ ᎠᏰᎵ, ᎥᏝᏃ ᎤᏁᎳᎩ ᎤᏁᎵᏍᏗ ᏱᎨᏎᏍᏗ ᏧᏂᏲᎱᏒᎯ ᏗᏂᏰᎸ ᏗᏓᏂᏐᏗᏱ ᏧᏂᏅᏗᏱ.

source: And those who are on the earth will have pleasure and delight over them; and they will send offerings one to another because these two prophets gave great trouble to all on the earth.
chr: ᎿᏃ ᎡᎶᎯ ᎠᏁᎯ ᏛᎾᎵᎮᎵᏥ ᎾᏍᎩ ᎨᏒ ᏅᏗᎦᏍᏙᏗᏍᎨᏍᏗ, ᎠᎴ ᎣᏍᏛ ᎤᎾᏓᏅᏔᏩᏕᎨᏍᏗ, ᎠᎴ ᎪᎱᏍᏗ ᏓᎾᏓᏁᎸᎥᏍᎨᏍᏗ; ᎯᎠᏰᏃ ᎠᏂᏔᎵ ᎠᎾᏙᎴᎰᏍᎩ ᎬᏩᏂᎩᎵᏲᎢᏍᏔᏅᎩ ᎾᏍᎩ Ꮎ ᎡᎶᎯ ᎠᏁᎯ.

source: And after three days and a half the breath of life from God went into them, and they got up on their feet; and great fear came on those who saw them.
chr: ᏦᎢᏃ ᎢᎦ ᏅᎩᏁᏃ ᎠᏰᎵ ᎤᎶᏐᏅ ᎠᏓᏅᏙ ᎬᏂᏛ ᎠᏓᏁᎯ ᎤᏁᎳᏅᎯ ᏅᏓᏳᎵᏍᎪᎸᏔᏅᎯ ᎬᏩᏂᏴᎸᎩ, ᎠᎴ ᏚᎾᎴᏅᎩ, ᎾᏍᎩᏃ ᎬᏩᏂᎪᎲᎯ ᎤᏣᏘ ᎤᏂᎾᏰᏒᎩ.

source: And a great voice from heaven came to their ears, saying to them, Come up here. And they went up into heaven in the cloud, and were seen by those desiring their death.
chr: ᎤᎾᏛᎦᏅᎩᏃ ᎠᏍᏓᏯ ᏗᎧᏁᎬ ᎦᎸᎳᏗ ᏅᏓᏳᏓᎴᏅᎯ, ᎯᎠ ᏄᏂᏪᏎᎲᎢ, ᎡᏍᏓᎩᎳᏩ ᎠᏂ ᎢᏍᏗᎷᎩ. ᎦᎸᎳᏗᏃ ᏭᏂᎶᏒᎩ ᎤᎶᎩᎸ ᎤᎾᎵᏌᎳᏓᏅᎩ. ᎠᎴ ᎬᏩᏂᏍᎦᎩ ᎬᏩᏂᎪᎲᎩ.

source: And in that hour there was a great earth-shock and a tenth part of the town came to destruction; and in the earth-shock seven thousand persons came to their end: and the rest were in fear, and gave glory to the God of heaven.
chr: ᎾᎯᏳᏉᏃ ᎧᎳᏩᏗᏒ ᎤᏣᏘ ᎤᎵᏖᎸᏅᎩ ᎦᏙᎯ, ᎠᏍᎪᎯᏃ ᎢᎦᏛᎯ ᎨᏒ ᎦᏚᎲ ᎾᏍᎩ ᏌᏉ ᎢᏳᏪᏨᎯ ᎤᏲᏨᎩ, ᎦᏙᎯᏃ ᎠᎵᏖᎸᎲᏍᎬ ᎢᏳᎢ ᎦᎸᏉᎩ ᎢᏯᎦᏴᎵ ᏴᏫ ᏙᎨᏥᎸᎩ; ᎤᎾᎵᏃᎯᏴᎯᏃ ᎤᏂᏍᎦᎸᎩ, ᎠᎴ ᎦᎸᎳᏗ ᎡᎯ ᎤᏁᎳᏅᎯ ᎤᏂᎸᏉᏔᏅᎩ.

source: The second Trouble is past: see, the third Trouble comes quickly.
chr: ᏔᎵᏁ ᎤᏲ ᎨᏒ ᎤᎶᏐᏅ; ᎬᏂᏳᏉ ᏦᎢᏁ ᎤᏲ ᎬᏒ ᏞᎩᏳ ᏓᎦᎷᏥ.

source: And at the sounding of the seventh angel there were great voices in heaven, saying, The kingdom of the world has become the kingdom of our Lord, and of his Christ, and he will have rule for ever and ever.
chr: ᎦᎵᏉᎩᏁᏃ ᎨᏒ ᏗᎧᎿᏩᏗᏙᎯ ᎤᏤᎷᎯᏒᎩ; ᎠᎴ ᎦᎸᎳᏗ ᎢᏴᏛ ᎠᏍᏓᏯ ᏗᎧᏁᎬᎩ ᎩᎶᎢ, ᎯᎠ ᏅᏓᎦᏪᏍᎬᎩ, ᎠᏰᎵ ᏕᎪᏢᏩᏗᏒ ᎠᏂ ᎡᎶᎯ, ᎢᎦᏤᎵ ᎤᎬᏫᏳᎯ, ᎠᎴ ᎾᏍᎩ Ꮎ ᎤᏤᎵ ᎦᎶᏁᏛ ᏧᎾᏤᎵ ᏂᏕᎦᎵᏍᏓ; ᎠᎴ ᎾᏍᎩ Ꮎ ᏂᎪᎯᎸ ᎠᎴ ᏂᎪᎯᎸ ᎤᎬᏫᏳᎯ ᎨᏎᏍᏗ.

source: And the four and twenty rulers, who are seated before God on their high seats, went down on their faces and gave worship to God, saying,
chr: ᏅᎩᏦᏁᏃ ᎢᏯᏂᏛ ᏧᎾᏛᏐᏅᎯ ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᏄᏛᏅ ᎢᎬᏱᏗᏢ ᏕᎦᏍᎩᎸ ᏣᏂᏅᎩ, ᏚᎾᎵᏯᏍᏚᏅᎩ, ᎠᎴ ᎤᎾᏓᏙᎵᏍᏓᏁᎸᎩ ᎤᏁᎳᏅᎯ,

source: We give you praise, O Lord God, Ruler of all, who is and who was; because you have taken up your great power and are ruling your kingdom.
chr: ᎯᎠ ᏄᏂᏪᏒᎩ, ᎢᏨᏯᎵᏒᎵᏤᎭ, ᏂᎯ ᏣᎬᏫᏳᎯ ᏣᏁᎳᏅᎯ, ᏫᎾᏍᏛᎾ ᏣᎵᏂᎩᏛ, ᏂᎯ ᎾᏍᎩ ᏤᎭ, ᎠᎴ ᎾᏍᎩ ᏤᎲᎩ, ᎠᎴ ᎾᏍᎩ ᏤᎮᏍᏗ; ᏅᏗᎦᎵᏍᏙᏗᎭ ᏥᏣᎩᏒ ᎤᏣᏘ ᏣᎵᏂᎩᏗᏳ ᎨᏒᎢ, ᎠᎴ ᏣᎬᏫᏳᎯ ᏥᏂᏣᎵᏍᏔᏅ.

source: And the nations were angry, and your wrath has come, and the time for the dead to be judged, and the time of reward for your servants, the prophets, and for the saints, and for those in whom is the fear of your name, small and great, and the time of destruction for those who made the earth unclean.
chr: ᎤᎾᏓᏤᎵᏛᏃ ᏴᏫ ᏓᏁᏩᏗᏒ ᎤᏂᎿᎸᏨᎩ, ᎠᎴ ᏂᎯ ᎾᎯᏳ ᏣᏔᎳᏬᎯᏍᏗ ᎨᏒ ᎤᏍᏆᎸᎲ, ᎠᎴ ᎾᎯᏳ ᏧᏂᏲᎱᏒᎯ ᏗᎨᎫᎪᏓᏁᏗ ᎨᏒᎢ, ᎠᎴ ᎾᏍᎩ ᏔᎫᏴᎡᏗ ᎨᏒ ᏘᏅᏏᏓᏍᏗ ᎠᎾᏙᎴᎰᏍᎩ, ᎠᎴ ᎤᎾᏓᏅᏘ, ᎠᎴ ᎾᏍᎩ Ꮎ ᏕᏣᏙᎥ ᎠᏂᎾᏰᏍᎩ, ᏧᎾᏍᏗ ᎠᎴ ᎾᏍᏉ ᏧᎾᏛᎾ; ᎠᎴ ᏗᏛᏙᏗᏱ ᎾᏍᎩ Ꮎ ᎡᎶᎯ ᎠᏂᏛᏗᏍᎩ ᎨᏒᎢ.

source: And the house of God which is in heaven was open; and the ark of his agreement was seen in his house, and there were flames and voices and thunders and an earth-shock and a rain of ice.
chr: ᎤᏁᎳᏅᎯᏃ ᎤᏤᎵ ᏗᎦᎳᏫᎢᏍᏗᏱ ᏓᏳᏂᏍᏚᎢᏒᎩ ᎦᎸᎳᏗ, ᎠᎴ ᏩᎪᏩᏛᏗ ᎨᏒᎩ ᎾᎿ ᎤᏤᎵ ᏗᎦᎳᏫᎢᏍᏗᏱ ᎦᏁᏌᎢ ᏗᎧᎿᏩᏛᏍᏗ ᏗᎦᎶᏗ; ᎠᎴ ᏚᎾᎦᎸᎲᎩ, ᎠᎴ ᏚᏂᏁᏨᎩ, ᎠᎴ ᏚᏴᏓᏆᎶᎥᎩ, ᎠᎴ ᎪᏙᎯ ᎤᎵᏖᎸᏅᎩ, ᎠᎴ ᎤᏍᎦᏎᏗ ᎤᏁᏐᎠᏒᎩ.

source: And a great sign was seen in heaven: a A woman clothed with the sun, and with the moon under her feet, and on her head a crown of twelve stars.
chr: ᎦᎸᎶᎢᏃ ᎦᎸᏉᏗ ᎤᏰᎸᏛ ᎤᎾᏄᎪᏨᎩ; ᎠᎨᏴ ᏅᏙ ᎢᎦ-ᎡᎯ ᎤᏄᏬᏍᏛᎩ, ᏅᏙᏃ ᏒᏃᏱ-ᎡᎯ ᎤᎳᏍᏓᎥᎩ, ᎤᎵᏍᏚᎸᎩᏃ ᎠᎵᏍᏚᎶ ᏔᏔᏚ ᏃᏈᏏ ᏗᎪᏢᏔᏅᎯ.

source: And she was with child; and she gave a cry, in the pains of childbirth.
chr: ᎾᏍᎩᏃ ᎦᏁᎵᏛ ᎨᏒ ᎢᏳᏍᏗ, ᎤᏪᎷᏅᎩ ᎠᎴ ᎤᎾᏄᎪᏫᏏᏕᎾ ᎨᏒᎩ, ᎠᎴ ᎡᎯᏍᏗ ᎤᏓᏅᏛ ᎤᏚᎵᏍᎬᎩ ᎤᎾᏄᎪᏫᏍᏗᏱ [ᎠᏲᎵ.]

source: And there was seen another sign in heaven; a great red dragon, having seven heads and ten horns, and on his heads seven crowns.
chr: ᎠᎴ ᏅᏩᏓᎴ ᎤᏍᏆᏂᎪᏗ ᎤᎾᏄᎪᏨᎩ ᎦᎸᎳᏗ; ᎠᎴ ᎬᏂᏳᏉ ᎤᏔᏅ ᎩᎦᎨ ᎢᎾᏛ [ᏫᏥᎪᎥᎩ,] ᎦᎸᏉᎩ ᏓᏍᎫᏓᏛᎩ, ᎠᎴ ᎠᏍᎪᎯ ᏕᎤᎷᎬᎩ, ᎠᎴ ᎦᎵᏉᎩ ᏚᎵᏍᏚᎸᎩ ᏓᏍᎫᏓᏛᎢ.

source: And his tail was pulling a third part of the stars of heaven down to the earth, and the dragon took his place before the woman who was about to give birth, so that when the birth had taken place he might put an end to her child.
chr: ᎦᏂᏓᏛᏃ ᏃᏈᏏ ᎦᎸᎳᏗ ᎠᏂᎧᎸ ᏦᎢ ᎢᏗᎦᏛᎯ ᎨᏒ ᎾᏍᎩ ᏌᏉ ᎢᏳᏪᏨᎯ ᏕᎤᏎᏒᏔᏅᎩ, ᎠᎴ ᎦᏙᎯ ᏫᏚᏗᏅᏒᎩ; ᎢᎾᏛᏃ ᎢᎬᏱᏗᏢ ᎤᎴᏅᎩ ᎠᎨᏴ ᏄᏛᏅᎢ, ᎾᏍᎩ ᎤᎾᏄᎪᏫᏏᏕᎾ [ᎠᏲᎵ] ᎾᏍᎩ ᎤᏕᏃᏅᎯᏉ ᎤᏪᏯᎣᎲᏍᏗᏱ ᎤᏰᎸᏒᎩ.

source: And she gave birth to a son, a male child, who was to have rule over all the nations with a rod of iron: and her child was taken up to God and to his high seat.
chr: ᎠᏍᎦᏯᏃ ᎠᏲᎵ ᎤᎾᏄᎪᏫᏒᎩ ᎾᏍᎩ ᎠᏙᎳᏅᏍᏗ ᏔᎷᎩᏍᎩ ᎪᏢᏔᏅᎯ ᎤᏮᏙᏗ ᎨᏒᎩ ᏗᎬᏩᏁᎶᏙᏗᏱ ᎢᏳᏩᏁᏗᏱ ᏂᎦᏛ ᎤᎾᏓᏤᎵᏛ ᏓᏁᏩᏗᏒ ᏴᏫ; ᎾᏍᎩ ᎤᏪᏥ ᎤᏁᎳᏅᏱ ᏩᏥᏅᏍᏔᏅᎩ, ᎠᎴ ᎤᎾᎳᏅᎯ ᎤᏪᏍᎩᎸᎢ.

source: And the woman went in flight to the waste land, where she has a place made ready by God, so that there they may give her food a thousand, two hundred and sixty days.
chr: ᎠᎨᏴᏃ ᎤᎵᏘᏒᎩ ᎢᎾᎨ ᏭᎶᏒᎩ, ᎾᎿ ᎤᏁᎳᏅᎯ ᎤᏛᏅᎢᏍᏓᏁᎸᎢ, ᎾᏍᎩ ᎠᎨᎳᏍᏗᏱ ᏌᏉ ᎢᏯᎦᏴᎵ ᏔᎵᏧᏈ ᏑᏓᎵᏍᎪᎯ ᏧᏒᎯᏛ.

source: And there was war in heaven: Michael and his angels going out to the fight with the dragon; and the dragon and his angels made war,
chr: ᏓᎿᏩᏃ ᏄᎵᏍᏔᏅᎩ ᎦᎸᎳᏗ; ᎹᏱᎩᎵ ᎠᎴ ᎾᏍᎩ ᏧᏤᎵ ᏗᏂᎧᎿᏩᏗᏙᎯ ᏚᎾᎵᎸᎩ ᏚᏂᎦᏘᎸᏒᎩ ᎢᎾᏛ; ᎢᎾᏛᏃ ᎠᎴ ᎾᏍᎩ ᏧᏤᎵ ᏗᏂᎧᎿᏩᏗᏙᎯ ᏚᎾᏟᏴᎲᎩ,

source: And they were overcome, and there was no more place for them in heaven.
chr: ᎠᎴ ᎥᏝ ᏳᎾᏓᏎᎪᎩᏎᎢ; ᎥᏝ ᎠᎴ ᎿᏉ ᎢᎸᎯᏳ ᏳᏂᏩᏛᎮ ᎦᎸᎳᏗ ᎤᎾᏕᏗᏱ.

source: And the great dragon was forced down, the old snake, who is named the Evil One and Satan, by whom all the earth is turned from the right way; he was forced down to the earth, and his angels were forced down with him.
chr: ᎾᏍᎩᏃ Ꮎ ᎤᏔᏅ ᎢᎾᏛ ᎠᏥᏄᎪᏫᏒᎩ, ᎾᏍᎩ Ꮎ ᎠᎦᏴᎵ ᎢᎾᏛ, ᎠᏍᎩᎾ ᏣᎪᏎᎭ, ᎠᎴ ᏎᏓᏂ, ᎾᏍᎩ ᏥᏕᎦᎶᏄᎮᎭ ᏂᎬᎾᏛ ᎡᎶᎯ [ᎠᏁᎯ;] ᎾᏍᎩ ᏓᏰᏥᏄᎪᏫᏒᎩ ᎡᎶᎯ ᏓᏰᎦᏓᎢᏅᏒᎩ, ᎠᎴ ᎾᏍᎩ ᏧᏤᎵ ᏗᏂᎧᎿᏩᏗᏙᎯ ᎢᏧᎳᎭ ᏓᎨᏥᏄᎪᏫᏒᎩ.

source: And a great voice in heaven came to my ears, saying, Now is come the salvation, and the power, and the kingdom of our God, and the authority of his Christ: because he who says evil against our brothers before our God day and night is forced down.
chr: ᎠᏆᏛᎦᏅᎩᏃ ᎠᏍᏓᏯ ᎧᏁᎬ ᎯᎠ ᏅᏗᎦᏪᏍᎬ ᎦᎸᎳᏗ, ᎿᏉ ᎠᎵᏰᎢᎶᎦ ᎠᎵᏍᏕᎸᏙᏗ ᎨᏒ ᎠᎴ ᎤᎵᏂᎩᏛ ᎨᏒᎢ, ᎠᎴ ᎢᎦᏁᎳᏅᎯ ᎾᎿ ᎤᎬᏫᏳᎯ ᎨᏒᎢ, ᎠᎴ ᎤᎵᏂᎩᏗᏳ ᎨᏒ ᎦᎶᏁᏛ ᎾᏍᎩ ᎤᏤᎵᎦ; ᎢᏓᎵᏅᏟᏰᏃ ᎨᏒ ᎤᏄᎯᏍᏗᏍᎩ ᎡᎳᏗ ᏩᎦᏓᎤᎦ; ᎾᏍᎩ ᏧᏄᎯᏍᏗᏍᎬ ᎢᎦᏁᎳᏅᎯ ᎠᎦᏔᎲᎢ ᎢᎦ ᎠᎴ ᏒᏃᏱ ᏗᎬᏩᏜᏍᏗ.

source: And they overcame him through the blood of the Lamb and the word of their witness; and loving not their lives they freely gave themselves up to death.
chr: ᎠᎴ ᎬᏩᏎᎪᎩᏍᏔᏅᎩ ᎤᏃᏕᎾ ᎠᎩᎾ ᎤᎩᎬ, ᎠᎴ ᎬᏂᎨᏒ ᎾᏅᏁᎲ ᎤᏃᎯᏳᏒᎢ, ᎾᏍᎩ ᏓᏅᏅ ᏂᏚᏂᎸᏉᏛᎾ ᎨᏒᎢ.

source: Be glad then, O heavens, and you who are in them. But there is trouble for the earth and the sea: because the Evil One has come down to you, being very angry, having the knowledge that he has but a short time.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏣᎵᎮᎵᎩ ᏂᎦ ᎦᎸᎶᎢ ᎨᏒᎢ, ᎠᎴ ᏂᎯ ᎾᎿ ᏥᏤᎭ. ᎤᏲᎢᏳ ᎢᏣᎵᏍᏓᏁᏗ ᎡᎶᎯ ᎢᏤᎯ, ᎠᎴ ᎠᎺᏉᎯ ᎢᏤᎯ! ᎠᏍᎩᎾᏰᏃ ᎢᏣᏠᎠᏎᎵᎦ, ᎤᏣᏘ ᎤᏔᎳᏬᏍᎬᎢ ᎠᎦᏔᎭᏰᏃ ᎤᏍᏆᎳᎯᏳ ᎨᏒ ᎠᎦᎵᏍᎪᎸᏓᏁᎸᎢ.

source: And when the dragon saw that he was forced down to the earth, he made cruel attacks on the woman who gave birth to the male child.
chr: ᎢᎾᏛᏃ ᎤᏙᎴᎰᏒ ᎦᏙᎯ ᏣᎦᏓᎢᏅᏒᎢ, ᎤᏕᏯᏙᏔᏅᎩ ᎠᎨᏴ ᎾᏍᎩ Ꮎ ᎠᏍᎦᏯ ᎤᎾᏄᎪᏫᏒᎯ.

source: And there were given to the woman two wings of a great eagle, so that she might go in flight into the waste land, to her place, where she is given food for a time, and times, and half a time, from the face of the snake.
chr: ᎠᎨᏴᏃ ᏔᎵ ᏓᏥᏕᎸᎩ ᎠᏬᏎᎵ ᎤᏔᏅ ᏗᎧᏃᎨ, ᎾᏍᎩ ᎢᎾᎨ ᏭᏃᎯᎸᏍᏙᏗᏱ ᎠᏥᏰᎸᎾᏁᎸᎩ, ᎾᎿ ᎤᏤᎵᎪᎯ ᏗᎨᏒᎢ, ᎾᎿ ᎠᎨᎳᏍᏗᏱ ᏑᏕᏘᏴᏛ, ᎠᎴ ᏔᎵ ᏧᏕᏘᏴᏛ, ᎠᎴ ᎠᏰᎵ ᎢᏳᏕᏘᏴᏛ, ᎾᏍᎩ ᎠᏥᎧᎲᏍᏗᏱ ᎢᎾᏛ ᎠᎦᏔᎲᎢ.

source: And the snake sent out of his mouth after the woman a river of water, so that she might be taken away by the stream.
chr: ᎢᎾᏛᏃ ᎠᎰᎵ ᏓᏳᏄᎪᏫᏒᎩ ᎠᎹ ᏥᎦᏃᎱᎩᏍᎪ ᎾᏍᎩᏯᎢ, ᎠᎨᏴ ᎤᎨᎮᎩ ᎾᏍᎩ ᎦᏃᎱᎩᏍᎬ ᎤᏅᏍᏙᏗᏱ ᎤᏰᎸᏅᎩ.

source: And the earth gave help to the woman, and with open mouth took up the river which the dragon sent out of his mouth.
chr: ᎦᏙᎯᏃ ᎤᏍᏕᎸᎲᎩ ᎠᎨᏴ, ᎠᎴ ᎦᏙᎯ ᎤᏍᏚᎢᏒᎩ ᎠᎰᎵ ᎠᎴ ᎤᎩᏐᏅᎩ ᎦᏃᎱᎩᏍᎬ ᎾᏍᎩ ᎢᎾᏛ ᎠᎰᎵ ᏅᏓᏳᏄᎪᏫᏒᎯ.

source: And the dragon was angry with the woman and went away to make war on the rest of her seed, who keep the orders of God, and the witness of Jesus:
chr: ᎠᎴ ᎢᎾᏛ ᎤᎿᎸᏤᎸᎩ ᎠᎨᏴ, ᎠᎴ ᏓᎿᏩ ᎢᏧᏩᏁᏗᏱ ᎤᏰᎸᏅᎩ ᎤᎾᎵᏃᎯᏴᎯ ᎾᏍᎩ [ᎠᎨᏴ] ᎤᏁᏢᏔᏅᎯ ᎨᏒᎢ, ᎾᏍᎩ Ꮎ ᎠᏂᏍᏆᏂᎪᏗᏍᎩ ᏗᎧᎿᏩᏛᏍᏗ ᎤᏁᎳᏅᎯ ᏧᏤᎵᎦ, ᎠᎴ ᎤᏂᎯ ᏥᏌ ᎦᎶᏁᏛ ᎤᏤᎵ ᎪᎯᏳᏗᏍᎩ.

source: And he took his place on the sand of the sea. And I saw a beast coming up out of the sea, having ten horns and seven heads, and on his horns ten crowns, and on his heads unholy names.
chr: ᎠᎺᏉᎯᏃ ᎤᎶᏗ ᏃᏳᎯ ᎨᏒ ᎥᏆᎴᏔᏅᎩ, ᎠᎴ ᏅᎩ ᏗᎦᏅᏌᏗ ᏥᎪᎥᎩ ᎠᎺᏉᎯ ᏓᏳᏚᎩᏒᎩ, ᎦᎵᏉᎩ, ᏓᏍᎫᏓᏛᎩ ᎠᎴ ᎠᏍᎪᎯ ᏚᎷᎬᎩ, ᏚᎷᎬᏃ ᎠᏍᎪᎯ ᏚᎵᏍᏚᎸᎩ, ᏓᏍᎫᏓᏛᏃ ᎤᏁᎳᏅᎯ ᏚᏙᎥ ᎠᏐᏢᎢᏍᏙᏗ ᎨᏒ ᎪᏪᎸᎩ.

source: And the beast which I saw was like a leopard, and his feet were as the feet of a bear, and his mouth as the mouth of a lion: and the dragon gave him his power and his seat and great authority.
chr: ᎿᏃ ᏅᎩ ᏗᎦᏅᏌᏗ ᏥᎪᎥᎯ ᏢᏓᏥᏧᎶᎸᏗ ᎾᏍᎩᏯ ᎨᏒᎩ, ᏚᎳᏍᎬᏃ ᏲᏅᏥᏚᎳᏍᎦ ᎾᏍᎩᏯ ᎨᏒᎩ, ᎠᎰᎵᏃ ᏢᏓᏥ ᎤᏃᏕᏅ ᎠᎰᎵ ᏥᏄᏍᏙ ᎾᏍᎩᏯ ᎨᏒᎩ, ᎢᎾᏛᏃ ᎤᏁᎸᎩ ᎤᏤᎵ ᎤᎵᏂᎬᎬᎢ ᎠᎴ ᎤᏤᎵ ᎤᏪᏗᏱ ᎨᏒᎢ, ᎠᎴ ᎤᏣᏗ ᎢᏳᏛᏁᎵᏓᏍᏗᏱ ᎤᎵᏍᎪᎸᏓᏁᎸᎩ.

source: And I saw one of his heads as if it had been given a death-wound; and his death-wound was made well: and all the earth was wondering at the beast.
chr: ᏌᏉᏃ ᎠᏍᎫᏓᏛ ᎠᎩᎪᎲᎩ ᎬᏩᏲᎱᎯᏍᏗ ᎢᏴᏛ ᏣᏥᏐᏅᏃ ᏓᏤᎸᎩ; ᎠᎴ ᎾᏍᎩ ᎬᏩᏲᎱᎯᏍᏗ ᎢᏴᏛ ᎠᏥᏐᏅᏅ ᎤᏗᏩᏒᎯ ᎨᏒᎩ; ᎠᎴ ᏂᎬᎾᏛ ᎡᎶᎯ [ᎠᏁᎯ] ᎠᏂᏍᏆᏂᎪᏍᎬᎩ [ᎠᎴ] ᎠᏂᏍᏓᏩᏗᏒᎩ ᎾᏍᎩ Ꮎ ᏅᎩ-ᏗᎦᏅᏌᏗ.

source: And they gave worship to the dragon, because he gave authority to the beast; and worshipping the beast, they said, Who is like the beast? and who is able to go to war with him?
chr: ᎠᎴ ᎤᎾᏓᏙᎵᏍᏓᏁᎸᎩ ᎢᎾᏛ ᎾᏍᎩ ᏅᎩ-ᏓᎦᏅᏌᏗ ᎤᎵᏂᎬᎬ ᎤᏁᎸᎯ ᎨᏒᎢ; ᎠᎴ ᎾᏍᎩ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎤᎾᏓᏙᎵᏍᏓᏁᎸᎩ, ᎯᎠ ᎾᏂᏪᏍᎬᎩ, ᎦᎪ ᏅᎩ-ᏗᎦᏅᏌᏗ ᏄᏍᏛ ᎾᏍᎩᏯ ᏄᏍᏗ? ᎦᎪ ᏰᎵ ᎾᏍᎩ ᏓᎿᏩ ᏱᎾᏅᎦ?

source: And there was given to him a mouth to say words of pride against God; and there was given to him authority to go on for forty-two months.
chr: ᎠᎴ ᎠᎰᎵ ᎠᏥᏁᎸᎩ ᎾᏍᎩ ᎬᏗᏍᎬ ᎤᏣᏘ ᎠᏢᏈᏍᏗ ᎨᏒ ᎦᏬᏂᏍᎬᎩ ᎠᎴ ᎠᏐᏢᎢᏍᏗᏍᎬᎩ; ᎠᎴ ᎠᎦᎵᏍᎪᎸᏓᏁᎸᎩ ᏅᎦᏍᎪᎯ ᏔᎵᎦᎵ ᎢᏯᏅᏙ ᎤᏕᏗᏱ.

source: And his mouth was open to say evil against God, and against his name and his Tent, even against those who are in heaven.
chr: ᎠᎴ ᎠᎰᎵ ᎤᏍᏚᎢᏒᎩ ᎤᏁᎳᏅᎯ ᎠᏐᏢᎢᏍᏗᏍᎬᎢ, ᏚᏙᎥ ᎦᎬᏩᏐᏢᏙᏗᏱ, ᎠᎴ ᎾᏍᎩ ᎤᏤᎵ ᎦᎵᏦᏛᎢ, ᎠᎴ ᎾᏍᎩ Ꮎ ᎦᎸᎳᏗ ᎠᏁᎯ.

source: And it was given to him to make war on the saints and to overcome them: and there was given to him authority over every tribe and people and language and nation.
chr: ᎠᎴ ᎾᏍᎩ ᎠᏥᏁᎸᎩ ᎤᎾᏓᏅᏘ ᏓᎿᏩ ᎢᏳᏅᏁᏗᏱ, ᎠᎴ ᎾᏍᎩ ᏧᏎᎪᎩᏍᏗᏱ; ᎠᎴ ᎠᏥᏁᎸᎩ ᎾᏍᎩ ᎢᏳᏩᏂᏐᏗᏱ ᏗᎬᏩᏁᎶᏙᏗᏱ ᎾᏂᎥ ᏓᏂᎳᏍᏓᎳᏩᏗᏒᎢ, ᎠᎴ ᏧᏓᎴᏅᏛ ᏗᏂᏬᏂᏍᎩ ᎨᏒᎢ, ᎠᎴ ᎤᎾᏓᏤᎵᏛ ᏴᏫ ᏓᏁᏩᏗᏒᎢ.
